Acknowledgment: https://stat430-sp21.hknguyen.org/

In [68]:
import pandas as pd
import numpy as np

obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

# Introduction (Series)

In [4]:
type(obj)

pandas.core.series.Series

In [8]:
print(obj[0])
print()
print(obj[[0, 3]])

4

0    4
3    3
dtype: int64

In [10]:
print(obj[0:2])

0    4
1    7
dtype: int64

In [12]:
print(obj[obj < 2])

2   -5
dtype: int64

In [13]:
# select only even observations
obj[obj % 2 == 0]

0    4
dtype: int64

In [6]:
obj2 = pd.Series([4, 7, -5, 3], index=['aa', 'b', 'c', 'd'])
obj2

aa    4
b     7
c    -5
d     3
dtype: int64

In [9]:
print(obj2['b'])
print(obj2[1])

7
7

In [11]:
print(obj2['b':'c'])

b    7
c   -5
dtype: int64

In [14]:
print(obj2.loc['b'])
print(obj2.loc['b':'c'])

7
b    7
c   -5
dtype: int64

In [15]:
# index location
print(obj2.iloc[1])
print(obj2.iloc[1:2])

7
b    7
dtype: int64

# Math

In [16]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5])
s1

0    7.3
1   -2.5
2    3.4
3    1.5
dtype: float64

In [17]:
print(s1 + s1)
print(s1 * 5)
print(s1 / 2)
print(s1 ** 2)

0    14.6
1    -5.0
2     6.8
3     3.0
dtype: float64
0    36.5
1   -12.5
2    17.0
3     7.5
dtype: float64
0    3.65
1   -1.25
2    1.70
3    0.75
dtype: float64
0    53.29
1     6.25
2    11.56
3     2.25
dtype: float64

In [18]:
# fills in NaN
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1])
s1 + s2

0    5.2
1    1.1
2    1.9
3    5.5
4    NaN
dtype: float64

In [19]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

print(s1 + s2)
print(s1.add(s2, fill_value=0))

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64
a    5.2
c    1.1
d    3.4
e    0.0
f    4.0
g    3.1
dtype: float64

# Introduction (Pandas DF)

In [26]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [21]:
frame.describe()

              year       pop
count     6.000000  6.000000
mean   2001.500000  2.550000
std       1.048809  0.836062
min    2000.000000  1.500000
25%    2001.000000  1.875000
50%    2001.500000  2.650000
75%    2002.000000  3.125000
max    2003.000000  3.600000

In [22]:
frame.dtypes

state     object
year       int64
pop      float64
dtype: object

In [24]:
# ramen['Country']

print(frame["year"])
print(frame.year)
print(frame.year == frame["year"])

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64
0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64
0    True
1    True
2    True
3    True
4    True
5    True
Name: year, dtype: bool

In [28]:
frame.iloc[3, 1]

2001

In [29]:
print(frame.iloc[0, 1:2])
print(frame.iloc[0, :])

year    2000
Name: 0, dtype: object
state    Ohio
year     2000
pop       1.5
Name: 0, dtype: object

In [31]:
print(type(frame.iloc[4, 0]))
print(type(frame.iloc[4, 1:5]))

<class 'str'>
<class 'pandas.core.series.Series'>

In [33]:
frame.iloc[[0, 2, 3, 5], :]

    state  year  pop
0    Ohio  2000  1.5
2    Ohio  2002  3.6
3  Nevada  2001  2.4
5  Nevada  2003  3.2

In [34]:
# .loc can use labels
frame.loc[0, 'pop']

1.5

In [35]:
frame['state'] == 'Ohio'

0     True
1     True
2     True
3    False
4    False
5    False
Name: state, dtype: bool

In [37]:
# method 1
frame[frame['state'] == 'Ohio']

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7
2  Ohio  2002  3.6

In [38]:
# method 2
frame.loc[frame['state'] == 'Ohio']

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7
2  Ohio  2002  3.6

In [41]:
frame[(frame['state'] == 'Ohio') & (frame['year'] == 2001)]

  state  year  pop
1  Ohio  2001  1.7

# Reindexing

In [42]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [43]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [44]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [45]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [46]:
new_obj = obj.drop('c')
new_obj

d    4.5
b    7.2
a   -5.3
dtype: float64

In [47]:
frame.drop(3)

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [48]:
frame.drop([0, 1, 2, 3, 4])

    state  year  pop
5  Nevada  2003  3.2

In [49]:
frame.drop('year', axis=1)

    state  pop
0    Ohio  1.5
1    Ohio  1.7
2    Ohio  3.6
3  Nevada  2.4
4  Nevada  2.9
5  Nevada  3.2

# apply functions

In [55]:
f = lambda x: x.max() - x.min()
print(f)
data = {'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
print(data)

frame = pd.DataFrame(data)
print(frame.apply(f))

<function <lambda> at 0x7fbd9e5ee950>
{'year': [2000, 2001, 2002, 2001, 2002, 2003], 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
year    3.0
pop     2.1
dtype: float64

In [51]:
# side-note: A lambda function is a small anonymous function.
# A lambda function is a small anonymous function.
x = lambda a : a + 10
print(x(5))

15

In [56]:
frame.apply(f, axis=1)

0    1998.5
1    1999.3
2    1998.4
3    1998.6
4    1999.1
5    1999.8
dtype: float64

In [57]:
frame.apply(f, axis=0)

year    3.0
pop     2.1
dtype: float64

In [53]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

     year  pop
min  2000  1.5
max  2003  3.6

In [58]:
# udf = user defined function
cube = lambda x: x**3
frame.applymap(cube)

         year     pop
0  8000000000   3.375
1  8012006001   4.913
2  8024024008  46.656
3  8012006001  13.824
4  8024024008  24.389
5  8036054027  32.768

In [59]:
# map() is for Series
frame['year'].map(cube)

0    8000000000
1    8012006001
2    8024024008
3    8012006001
4    8024024008
5    8036054027
Name: year, dtype: int64

# Sorting

In [66]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [61]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [62]:
obj.sort_values()

d    0
a    1
b    2
c    3
dtype: int64

In [63]:
obj.sort_values(ascending = False)

c    3
b    2
a    1
d    0
dtype: int64

In [64]:
obj.rank()

d    1.0
a    2.0
b    3.0
c    4.0
dtype: float64

# Descriptive Statistics

In [69]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                 [np.nan, np.nan], [0.75, -1.3]],
                  columns=['one', 'two'])
df

    one  two
0  1.40  NaN
1  7.10 -4.5
2   NaN  NaN
3  0.75 -1.3

In [70]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [71]:
df.sum(axis='columns')

0    1.40
1    2.60
2    0.00
3   -0.55
dtype: float64

In [72]:
df.sum(axis=1, skipna=False)

0     NaN
1    2.60
2     NaN
3   -0.55
dtype: float64

In [73]:
frame['year'].value_counts()

2001    2
2002    2
2000    1
2003    1
Name: year, dtype: int64

In [75]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                     'Qu2': [2, 3, 1, 2, 3],
                     'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [76]:
data.apply(pd.value_counts)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [77]:
data.apply(pd.value_counts).fillna(0)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [83]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [84]:
frame['state'].isin(['Ohio', 'OH'])

0     True
1     True
2     True
3    False
4    False
5    False
Name: state, dtype: bool

In [85]:
made_us = frame['state'].isin(['Ohio', 'OH'])
frame[made_us]

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7
2  Ohio  2002  3.6

In [86]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [87]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [88]:
string_data[0] = None
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [89]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [91]:
from numpy import nan as NA


data = pd.Series([1, NA, 3.5, NA, 7])
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

# Transformations

In [92]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [93]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [94]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [95]:
meat = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef',
                              'Bacon', 'pastrami', 'honey ham', 'nova lox'],
                    'ounces':  [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
meat

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [96]:
meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [97]:
meat['food'].map(meat_to_animal)

0       pig
1       pig
2       pig
3       NaN
4       cow
5       NaN
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [99]:
# meat['food'].str.lower()
meat['animal'] = meat['food'].str.lower().map(meat_to_animal)
meat

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [100]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [101]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [102]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

# Binning

In [104]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [105]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [106]:
print(cats.codes)
print(cats.categories)

[0 0 0 1 0 0 2 1 3 2 2 1]
IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [107]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [108]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
age_groups = pd.cut(ages, bins, labels=group_names)
age_groups

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [109]:
pd.value_counts(age_groups)

Youth         5
YoungAdult    3
MiddleAged    3
Senior        1
dtype: int64

In [110]:
data = np.random.randn(1000) # Normally distributed
qcut_cats = pd.qcut(data, 4) # cut into quantiles
pd.value_counts(qcut_cats)

(-2.964, -0.665]     250
(-0.665, -0.0231]    250
(-0.0231, 0.67]      250
(0.67, 3.951]        250
dtype: int64

In [111]:
cut_cats = pd.cut(data, 4)
pd.value_counts(cut_cats).sort_index()

(-2.97, -1.235]    119
(-1.235, 0.494]    565
(0.494, 2.222]     308
(2.222, 3.951]       8
dtype: int64

In [112]:
pd.value_counts(pd.qcut(data, [0, 0.1, 0.5, 0.9, 1])).sort_index()

(-2.964, -1.308]     100
(-1.308, -0.0231]    400
(-0.0231, 1.335]     400
(1.335, 3.951]       100
dtype: int64